// Exer13_07.cpp
/*************************第13章_练习_第7题************************\
实现一个类Rational，使其代表有理数。有理数可表达为两个整数的商或小数n/d，
其中n为整数分子，d为非0的正整数分母。不过，不必担心需要强制分母为非0。那
并不是本练习的目的。创建一个运算符，允许将有理数流输出到std::cout。除此
之外，可以自由选择添加多少个以及添加什么运算符。可以创建运算符来支持两个
有理数以及一个有理数和一个整数的乘法、加法、减法、除法和比较操作。可以
创建运算符来求反、递增或递减有理数。还可以将有理数转换为float或double
类型。对于Rational类，可以定义的运算符有许多。参考代码中的Rational类
支持超过20种不同的运算符，其中许多运算符对多种类型进行了重载。也许读者
可以为Rational类想出更多合理的运算符。不要忘记创建一个程序测试运算符是否
能够正确工作。
\*****************************************************************/
