/*************************第8章_练习_第3题************************
编写一个程序，它接收2~4个命令行实参。如果用少于2个或多于4个的实参调用
该程序，就输出一条消息，告诉用户应怎么做，然后退出。如果实参的个数是正
确的，就输出它们，一行输出一个参数。
注：命令行实参指的是main()函数的实参，详见本章第8.5节
*****************************************************************/
#include <iostream>

int main(int argc, char *argv[])
{
    if (argc < 3 || argc > 4)
        std::cout << "参数错误，请输入2~4个参数！" << std::endl;
    else
        for (int i{1}; i < argc; ++i) // 不用输出程序名称:argv[0]
            std::cout << "参数 " << i << " 是 " << argv[i] << std::endl;
}